README.tex
% Created 2010-08-16 Lun 18:04
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{t1enc}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{MotNet}
\author{Andrea Crotti, Marius Grysla, Oscar Dustmann}
\date{16 Agosto 2010}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}

\section{Next Improvements}
\label{sec-1}
\subsection{\textbf{DONE} add support for adaptative compression}
\label{sec-1_1}

   \texttt{CLOSED:} \textit{2010-07-31 Sab 18:21}

\begin{itemize}
\item CLOSING NOTE \textit{2010-07-31 Sab 18:21}
\end{itemize}
\subsection{\textbf{DONE} add cleaning exit code on exit}
\label{sec-1_2}

   \texttt{CLOSED:} \textit{2010-08-02 Lun 11:21}

\begin{itemize}
\item CLOSING NOTE \textit{2010-08-02 Lun 11:21} \\
Using signal and a generic closing function!
\end{itemize}

     
\subsection{\textbf{DONE} add support for an intermediate node that forwards everything}
\label{sec-1_3}

   \texttt{CLOSED:} \textit{2010-08-13 Ven 17:52}

\begin{itemize}
\item CLOSING NOTE \textit{2010-08-13 Ven 17:53} \\
working depending on humidity and luck
\end{itemize}
\section{Goal}
\label{sec-2}

  The goal of this project is to create a create a network between motes.
  Supposing we have mote A attached to a computer with an internet connection and mote b is attached to a computer without internet connection.

  Then traversing a theoretically arbitrary network of motes we can let B connect to the internet through the network.
\section{Architecture}
\label{sec-3}

  
\section{Files}
\label{sec-4}

  This is the tree of files in our application
\begin{itemize}
\item driver
    In this directory we have client and gateway program, written in C for linux systems with some bash scripts.

\begin{itemize}
\item reconstruct.c
      this module in charge of reconstructing the chunks we get from from the network
\item chunker.c
      functions to split the message into many chunks
\item client.c
      start the client version of the program
\item gateway.c
      start the gateway
\item tunnel.c
      manage the tunnel (open close write read)
\item setup.c
      all the functions used both by the client and the gateway
\item structs.c
      contain some useful functions to manage our own data structures
\item motecomm.c
      low level communication between motes and driver program
\item glue.c
\item structs.h
      This contains the basic data structures we use communicate with the motes.
\end{itemize}

\item motes-simple

\begin{itemize}
\item SimpleMoteAppC.nc
      configuration file
\end{itemize}

\item talks

\begin{itemize}
\item slides.org
      org-mode source file of the presentation
\item slides.tex
      tex beamer generated file from slides.org
\item *.svg
      images used
\item slides.pdf
      resulting slides
\end{itemize}

\end{itemize}

\end{document}
